In [4]:
# Importing Libraries
import numpy as np
import pandas as pd

In [5]:
#Importing datsets
dataset = pd.read_csv('Titanic_train.csv')
test = pd.read_csv('Titanic_test.csv')

In [6]:
#Quick glance at the dataset
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
#Information about the dataset regarding columns, NaNs, dtype of features etc.
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [8]:
#Testing dataset 
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [10]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [11]:
# Calculating Number of NaNs in the training dataset
pd.isna(dataset).sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
# Calculating Number of NaNs in the test dataset
pd.isna(test).sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [13]:
#Getting the correlation between features i.e. Whcih features are coorealated with one another
dataset.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [14]:
#Dropping the unwanted column. Cabin is dropped because of more no. of NaNs and I think the column Ticket won't 
#give any information about the data
dataset = dataset.drop(['Cabin', 'Ticket'], axis=1)
test = test.drop(['Cabin', 'Ticket'], axis=1)

**Filing the NaN**

In [15]:
# I have fill the NaNs by getting visuals of the Age of Passengers w.r.t. the PassengerClass they are travelling
def impute_NaN(cols):
    Age = cols[0]
    Pclass = cols[1]
    if(pd.isnull(Age)):
        if(Pclass==1):
            return 38
        elif(Pclass==2):
            return 29
        else:
            return 24
    else:
        return Age

In [16]:
dataset['Age'] = dataset[['Age', 'Pclass']].apply(impute_NaN, axis=1)

In [17]:
def impute_NaN(cols):
    Age = cols[0]
    Pclass = cols[1]
    if(pd.isnull(Age)):
        if(Pclass==1):
            return 42
        elif(Pclass==2):
            return 25
        else:
            return 23
    else:
        return Age

In [18]:
test['Age'] = test[['Age', 'Pclass']].apply(impute_NaN, axis=1)

In [19]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(3)
memory usage: 69.7+ KB

In [20]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 29.5+ KB

In [21]:
#Dropping any NaNs field
dataset.dropna(inplace=True)

In [22]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 10 columns):
PassengerId    889 non-null int64
Survived       889 non-null int64
Pclass         889 non-null int64
Name           889 non-null object
Sex            889 non-null object
Age            889 non-null float64
SibSp          889 non-null int64
Parch          889 non-null int64
Fare           889 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(3)
memory usage: 76.4+ KB

In [23]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           417 non-null float64
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 29.5+ KB

In [24]:
#Here, in the test dataset, One NaN is present in the Fare column. I have filled it with mean.
test['Fare'].fillna(test['Fare'].mean(), inplace=True)

In [25]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 9 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            418 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Fare           418 non-null float64
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 29.5+ KB

In [26]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 10 columns):
PassengerId    889 non-null int64
Survived       889 non-null int64
Pclass         889 non-null int64
Name           889 non-null object
Sex            889 non-null object
Age            889 non-null float64
SibSp          889 non-null int64
Parch          889 non-null int64
Fare           889 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(3)
memory usage: 76.4+ KB

**Feature Engineering**

In [27]:
#Encoding Categorical Variables
dataset = pd.get_dummies(dataset, columns=['Sex'])
test = pd.get_dummies(test, columns=['Sex'])

In [28]:
dataset = pd.get_dummies(dataset, columns=['Embarked'])
test = pd.get_dummies(test, columns=['Embarked'])

In [29]:
#Combining the Siblings and the Parents in one column and encoded them.
def is_alone(cols):
    SibSp = cols[0]
    Parch = cols[1]
    total_family = SibSp + Parch
    if(total_family == 0):
        return 1
    else:
        return 0

In [30]:
dataset['IsAlone'] = dataset[['SibSp', 'Parch']].apply(is_alone, axis=1)
test['IsAlone'] = test[['SibSp', 'Parch']].apply(is_alone, axis=1)

In [31]:
#As name won't give me mucg information. So, I decided to take their title and extracting infromation from the title
import re
def extract_title(name):
    title = re.search('([A-Za-z]+)\.', name)
    return title[1]

In [32]:
dataset['Title'] = dataset['Name'].apply(extract_title)
test['Title'] = test['Name'].apply(extract_title)

In [33]:
title_dict = {'Mr': 0, 'Miss': 1, 'Mrs': 2, 'Master': 3, 'Dr': 4, 'Rev': 5, 'Mlle': 6, 'Col': 7, 'Major': 8,
             'Mme': 9, 'Sir': 10, 'Jonkheer': 11, 'Capt': 12, 'Ms': 13, 'Countess': 14, 'Lady': 15, 'Don': 16}

In [34]:
dataset['Title'] = dataset['Title'].map(title_dict)
test['Title'] = test['Title'].map(title_dict)

In [35]:
#Dropping Name and PassengerID column
dataset.drop(columns=['Name', 'PassengerId'], axis=1, inplace=True)
test.drop(columns=['Name', 'PassengerId'], axis=1, inplace=True)

In [36]:
pclass_df = pd.get_dummies(data=dataset['Pclass'], prefix='Pclass', drop_first=True)
pclass_test = pd.get_dummies(data=test['Pclass'], prefix='Pclass', drop_first=True)

In [37]:
new_df = pd.concat([dataset, pclass_df], axis=1)
new_testdf = pd.concat([test, pclass_test], axis=1)

In [38]:
new_df.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,IsAlone,Title,Pclass_2,Pclass_3
0,0,3,22.0,1,0,7.2500,0,1,0,0,1,0,0,0,1
1,1,1,38.0,1,0,71.2833,1,0,1,0,0,0,2,0,0
2,1,3,26.0,0,0,7.9250,1,0,0,0,1,1,1,0,1
3,1,1,35.0,1,0,53.1000,1,0,0,0,1,0,2,0,0
4,0,3,35.0,0,0,8.0500,0,1,0,0,1,1,0,0,1

In [40]:
new_testdf.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,IsAlone,Title,Pclass_2,Pclass_3
0,3,34.5,0,0,7.8292,0,1,0,1,0,1,0.0,0,1
1,3,47.0,1,0,7.0000,1,0,0,0,1,0,2.0,0,1
2,2,62.0,0,0,9.6875,0,1,0,1,0,1,0.0,1,0
3,3,27.0,0,0,8.6625,0,1,0,0,1,1,0.0,0,1
4,3,22.0,1,1,12.2875,1,0,0,0,1,0,2.0,0,1

In [41]:
new_df.drop(columns=['Pclass'], axis=1, inplace=True)
new_testdf.drop(columns=['Pclass'], axis=1, inplace=True)

**Feature Scaling**

In [42]:
# Scaling the Age and Fare features so that it won't be afftected by the ML Algo.
from sklearn.preprocessing import StandardScaler
sc_cols = StandardScaler()

In [43]:
cols = ['Age', 'Fare']

In [44]:
X = new_df.drop(columns=['Survived'], axis=1)
y = new_df['Survived']

In [45]:
scaler = StandardScaler().fit(X[cols])

In [46]:
X[cols] = scaler.transform(X[cols])

In [47]:
# Feature scaling for the test dataset
test_scaler = StandardScaler().fit(new_testdf[cols])
new_testdf[cols] = test_scaler.transform(new_testdf[cols])

In [48]:
X.head()

,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,IsAlone,Title,Pclass_2,Pclass_3
0,-0.533353,1,0,-0.500240,0,1,0,0,1,0,0,0,1
1,0.676568,1,0,0.788947,1,0,1,0,0,0,2,0,0
2,-0.230873,0,0,-0.486650,1,0,0,0,1,1,1,0,1
3,0.449708,1,0,0.422861,1,0,0,0,1,0,2,0,0
4,0.449708,0,0,-0.484133,0,1,0,0,1,1,0,0,1

In [49]:
test.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,IsAlone,Title
0,3,34.5,0,0,7.8292,0,1,0,1,0,1,0.0
1,3,47.0,1,0,7.0000,1,0,0,0,1,0,2.0
2,2,62.0,0,0,9.6875,0,1,0,1,0,1,0.0
3,3,27.0,0,0,8.6625,0,1,0,0,1,1,0.0
4,3,22.0,1,1,12.2875,1,0,0,0,1,0,2.0

In [50]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [51]:
# Splitting the dataset into train and test for testing purpose of our model
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, train_size=0.7, random_state=1)

**Model Building**

In [52]:
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix

In [53]:
from sklearn.model_selection import GridSearchCV

In [54]:
svc_model = SVC()

In [55]:
svc_model.fit(X_train, y_train)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

SVC(C=1.0, cache_size=200, class_weight=None, coef0=0.0,
    decision_function_shape='ovr', degree=3, gamma='auto_deprecated',
    kernel='rbf', max_iter=-1, probability=False, random_state=None,
    shrinking=True, tol=0.001, verbose=False)

In [56]:
svc_predict = svc_model.predict(X_test)

In [57]:
accuracy_score(y_test, svc_predict)

0.850187265917603

In [58]:
new_testdf.dropna(inplace=True)

In [59]:
new_testdf.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 0 to 417
Data columns (total 13 columns):
Age           417 non-null float64
SibSp         417 non-null int64
Parch         417 non-null int64
Fare          417 non-null float64
Sex_female    417 non-null uint8
Sex_male      417 non-null uint8
Embarked_C    417 non-null uint8
Embarked_Q    417 non-null uint8
Embarked_S    417 non-null uint8
IsAlone       417 non-null int64
Title         417 non-null float64
Pclass_2      417 non-null uint8
Pclass_3      417 non-null uint8
dtypes: float64(3), int64(3), uint8(7)
memory usage: 25.7 KB

In [60]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 14 columns):
Survived      889 non-null int64
Age           889 non-null float64
SibSp         889 non-null int64
Parch         889 non-null int64
Fare          889 non-null float64
Sex_female    889 non-null uint8
Sex_male      889 non-null uint8
Embarked_C    889 non-null uint8
Embarked_Q    889 non-null uint8
Embarked_S    889 non-null uint8
IsAlone       889 non-null int64
Title         889 non-null int64
Pclass_2      889 non-null uint8
Pclass_3      889 non-null uint8
dtypes: float64(2), int64(5), uint8(7)
memory usage: 61.6 KB

np.savetxt("data_result.csv", svc_predict_test, delimiter=",")

In [88]:
test_result = pd.read_csv("copy.csv")
test_result.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [89]:
test_result = test_result.drop(['Pclass', 'Name','Sex', 'Age', 'Fare', 'SibSp', 'Parch', 'Ticket','Cabin', 'Ticket', 'Embarked'], axis=1)

In [90]:
test_result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 1 columns):
PassengerId    418 non-null int64
dtypes: int64(1)
memory usage: 3.3 KB

In [91]:
svc_predict_test = svc_model.predict(new_testdf)
len(svc_predict_test)

417

In [94]:
svc_predict_test

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 1, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1],
      dtype=int64)